#include <stdio.h>          
#include <malloc.h>
#include <stdlib.h>
#include <locale.h>
#include <math.h>
int main()
{
	setlocale(LC_ALL, "Rus");
	int** A;
	int n;
	int i = 0; int j = 0;
	//-----------------------------------------------
	//ВВОД РАЗМЕРНОСТИ МАССИВА
	printf("Введите размерность массива: ");
	while (!scanf_s("%d", &n) || n < 1)
	{
		printf("Ошибка! Вы ввели не число или число меньше 1.\n");
		rewind(stdin);
		printf("Введите размерность массива: ");
	}
	//-----------------------------------------------
	// ВЫДЕЛЕНИЕ ПАМЯТИ ПОД МАССИВ
	A = (int**)malloc(sizeof(int*) * n);
	for (i = 0; i < n; i++) // цикл выбора указателя на строку матрицы
		*(A + i) = (int*)malloc(sizeof(int) * n); // выделение памяти под строку матрицы
	//-----------------------------------------------
	// ЗАПОЛНЕНИЕ И ВЫВОД НА ЭКРАН НАЧАЛЬНОГО МАССИВА
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < n; j++)
		{
			printf("Введите a[%d][%d]: ", i, j);
			while (!scanf_s("%d", &A[i][j]))
			{
				printf("Ошибка! Вы ввели не число.\n");
				rewind(stdin);
				printf("Введите a[%d][%d]: ", i, j);
			}
		}
	}
	printf("\nИсходный массив:");
	for (i = 0; i < n; i++)
	{
		printf("\n");
		for (j = 0; j < n; j++)
		{
			printf("%d ", A[i][j]);
		}
	}
	printf("\n\n");
	//-----------------------------------------------
	// НАХОЖДЕНИЕ И ВЫВОД НА ЭКРАН МАКСИМАЛЬНОГО ПО МОДУЛЮ ЭЛЕМЕНТА
	int max = 0;    int maxi, maxj, el;
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < n; j++)
		{
			if ((abs(A[i][j])) > (abs(max)))
			{
				max = abs(A[i][j]);
				maxi = i;
				maxj = j;
				el = A[i][j];
			}
		}
	}
	printf("Максимальный элемент массива по модулю: %d\n", el);
	//-----------------------------------------------
	// УДАЛЕНИЕ СТОЛБЦА И СТРОКИ, В КОТОРО(М/Й) НАХОДИТСЯ МАКСИМАЛЬНЫЙ ПО МОДУЛЮ ЭЛЕМЕНТ 
	for (i = 0; i < n; i++)
	{
		for (j = maxj; j < n - 1; j++)
		{
			A[i][j] = A[i][j + 1];
		}
	}
	for (i = maxi; i < n - 1; i++)
		A[i] = A[i + 1];
	//-----------------------------------------------
	// ВЫВОД НА ЭКРАН МАССИВА БЕЗ СТРОКИ И СТОЛБЦА, В КОТОРО(М/Й) НАХОДИТСЯ МАКСИМАЛЬНЫЙ ПО МОДУЛЮ ЭЛЕМЕНТ 
	printf("Массив порядка n-1: \n");
	for (i = 0; i < n - 1; i++)
	{
		printf("\n");
		for (j = 0; j < n - 1; j++)
		{
			printf("%d ", A[i][j]);
		}
	}
	//-----------------------------------------------
	// ОСВОБОЖДЕНИЕ ПАМЯТИ
	for (i = 0; i < n-1; i++)
		free(A[i]);
	free(A);
	//-----------------------------------------------
	return 0;
}